page/TriplyClient.org
#+title: Triply Client
#+author: Wouter Beek
#+setupfile: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

Triply Client is the programming library that makes it easy to
interact with TriplyDB instances.  Triply Client allows you to
automate most operations that can be performed through the TriplyDB
GUI.

This document is a work in progress.  Please contact [[mailto:support@triply.cc][support@triply.cc]]
for more information.

* Getting started

This section gets you up and running with the Triply Client by setting
up a simple script.  The script will use Triply Client in order to
interact with a specific TriplyDB instance.

** Installation

The following steps are needed in order to install Triply Client:

1. Install [[https://nodejs.org][Node.js]] and [[https://www.npmjs.com][NPM]].

   Example for installation on recent Ubuntu versions:

   #+begin_src bash
   $ sudo apt install nodejs npm # Debian-based, e.g., Ubuntu.
   $ sudo dnf install nodejs npm # Red Hat-based, e.g., Fedora.
   #+end_src

2. Create a Triply API Token through the TriplyDB GUI.

3. In your current terminal session, export the following environment
   variables:

   #+begin_src bash
   $ export TRIPLY_API_TOKEN=<some-token>
   $ export TRIPLY_API_URL=<some-url>
   #+end_src

   You can also add these lines to your ~.profile~ file in order to
   add these environment variables to every future terminal session.

** Setting up a Triply Client project

The following steps are needed in order to setup a TypeScript project
that uses the Triply Client library:

1. Create a directory for your project:

   #+begin_src bash
   $ mkdir my_script
   #+end_src

2. Create a file called ~package.json~ with the following content
   within the ~my_script~ directory:

   #+begin_src json
   {
     "name": "script",
     "version": "1.0.0"
   }
   #+end_src

3. Install the TypeScript and Triply Client dependencies from within
   the ~my_script~ directory:

   #+begin_src bash
   $ npm install typescript @triply/client.js
   #+end_src

** Create your first script

Once you have performed the installation and project setup, perform
the following steps in order to create and run your first script that
uses the Triply Client library:

1. Create a file called ~script.ts~ and add the following contents:

   #+begin_src typescript
   // Import the Triply Client.
   import Client from "@triply/client.js/build/src/App";

   // Configure the Triply Client.
   const client = Client.get({
     token: process.env.TRIPLY_API_TOKEN,
     url: process.env.TRIPLY_API_URL
   });

   // Perform Triply Client requests within an async context.
   async function run() {
     // Our first Triply Client request: obtain information of the
     // current user.
     console.log(await client.getAccount().info());
   }
   run().catch(e => {
     console.error(e);
     process.exit(1);
   });
   #+end_src


2. Compile the TypeScript file into a corresponding JavaScript file:

   #+begin_src bash
   $ ./node_modules/.bin/tsc script.ts
   #+end_src

3. Run the JavaScript file:

   #+begin_src bash
   $ node script.js
   #+end_src

This should print the information of the current user to the terminal.
The current user is determined by the API Token that was set in the
~TRIPLY_API_TOKEN~ environment variable.

** Using the Atom text editor (optional)

The Atom text editor provides advanced support for programming in
TypeScript, which makes it easier to use Triply Client by showing
typing feedback in the editor and offering autocomplete suggestions:

1. Install the [[https://atom.io][Atom]] text editor.

2. In order to let Atom use the correct TypeScript version, add a file
   called ~tsconfig.json~ with the following contents to your project
   directory:

   #+begin_src json
   {
     "compilerOptions": {
       "lib": [ "es2015" ]
     }
   }
   #+end_src

3. From within the Atom preferences page, install the [[https://atom.io/packages/atom-typescript][atom-typescript]]
   package.

4. Start Atom over your script directory by running the following
   command from your ~my_project~ directory:

   #+begin_src sh
   atom .
   #+end_src

