page/TriplyClient.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-08 Wed 08:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Triply Client</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wouter Beek" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Triply Client</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org053352a">1. Getting started</a>
<ul>
<li><a href="#org11e349e">1.1. Installation</a></li>
<li><a href="#orga92abb9">1.2. Setting up a Triply Client project</a></li>
<li><a href="#orga167662">1.3. Create your first script</a></li>
<li><a href="#org18698b6">1.4. Using the Atom text editor (optional)</a></li>
</ul>
</li>
<li><a href="#org02c0449">2. Reference</a>
<ul>
<li><a href="#orga914073">2.1. Code examples</a></li>
<li><a href="#org148f87f">2.2. <code>Client</code></a>
<ul>
<li><a href="#orgc1a9c20">2.2.1. <code>getAccount()</code></a></li>
<li><a href="#org30412d2">2.2.2. <code>getAccount(accountName: string)</code></a></li>
</ul>
</li>
<li><a href="#orgccb49fe">2.3. <code>Account</code></a>
<ul>
<li><a href="#orgb2bfde2">2.3.1. <code>addDataset(settings: object)</code></a></li>
<li><a href="#org92b5f59">2.3.2. <code>datasets()</code></a></li>
<li><a href="#orgc6208c7">2.3.3. <code>getDataset(datasetName: string)</code></a></li>
<li><a href="#org8c3b656">2.3.4. <code>info()</code></a></li>
<li><a href="#org672a850">2.3.5. <code>name()</code></a></li>
<li><a href="#org82b1aee">2.3.6. <code>rename(newName: string)</code></a></li>
</ul>
</li>
<li><a href="#orgfc01344">2.4. <code>Dataset</code></a>
<ul>
<li><a href="#org0957934">2.4.1. <code>addService(serviceType: oneof("sparql"), name: string)</code></a></li>
<li><a href="#org376c76f">2.4.2. <code>assets()</code></a></li>
<li><a href="#orgda9db48">2.4.3. <code>delete()</code></a></li>
<li><a href="#org55a149e">2.4.4. <code>deleteGraph(graphName: string)</code></a></li>
<li><a href="#orgcd2c353">2.4.5. <code>getServices()</code></a></li>
<li><a href="#orga6afe71">2.4.6. <code>graphs()</code></a></li>
<li><a href="#orgf8ce3fd">2.4.7. <code>import(fromDataset: Dataset, graphs: mapping)</code></a></li>
<li><a href="#org61c0a70">2.4.8. <code>importedGraphs()</code></a></li>
<li><a href="#orga0a8aa3">2.4.9. <code>query()</code></a></li>
<li><a href="#org6c982c2">2.4.10. <code>removeAllGraphs()</code></a></li>
<li><a href="#org26bebd0">2.4.11. <code>rename(newName: string)</code></a></li>
<li><a href="#org6738cea">2.4.12. <code>renameGraph(fromGraphName: string, toGraphName: string)</code></a></li>
<li><a href="#org1eac5e7">2.4.13. <code>upload(filePaths: string[])</code></a></li>
<li><a href="#org767ef1d">2.4.14. <code>uploadAsset(assetName: string, filePath: string)</code></a></li>
</ul>
</li>
<li><a href="#orgd1a7a46">2.5. <code>Query</code></a></li>
<li><a href="#org29cde6f">2.6. <code>Service</code></a>
<ul>
<li><a href="#orga6b6d58">2.6.1. <code>create()</code></a></li>
<li><a href="#org24552cb">2.6.2. <code>getStatus()</code></a></li>
<li><a href="#org4c54a67">2.6.3. <code>info()</code></a></li>
<li><a href="#org1fff52b">2.6.4. <code>isUpToDate()</code></a></li>
<li><a href="#org1100990">2.6.5. <code>restart()</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org918ac2a">3. FAQ</a>
<ul>
<li><a href="#org7ade194">3.1. How to perform a SPARQL query?</a></li>
<li><a href="#org54116b5">3.2. What to do when the following error appears?</a>
<ul>
<li><a href="#org384bae0">3.2.1. Why must I set environment variable <code>TRIPLY_API_TOKEN</code>?</a></li>
<li><a href="#orgfecd499">3.2.2. Error: Unauthorized</a></li>
<li><a href="#org77b05fa">3.2.3. "No domain specified in configuration"</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Triply Client is the programming library that makes it easy to
interact with TriplyDB instances.  Triply Client allows you to
automate most operations that can be performed through the TriplyDB
GUI.
</p>

<p>
This document is a work in progress.  Please contact <a href="mailto:support@triply.cc">support@triply.cc</a>
for more information.
</p>

<div id="outline-container-org053352a" class="outline-2">
<h2 id="org053352a"><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-1">
<p>
This section gets you up and running with the Triply Client by setting
up a simple script.  The script will use Triply Client in order to
interact with a specific TriplyDB instance.
</p>
</div>

<div id="outline-container-org11e349e" class="outline-3">
<h3 id="org11e349e"><span class="section-number-3">1.1</span> Installation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The following steps are needed in order to install Triply Client:
</p>

<ol class="org-ol">
<li><p>
Install <a href="https://nodejs.org">Node.js</a> and <a href="https://www.npmjs.com">NPM</a>.
</p>

<p>
Example for installation on recent Ubuntu versions:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ sudo apt install nodejs npm <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Debian-based, e.g., Ubuntu.</span>
$ sudo dnf install nodejs npm <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Red Hat-based, e.g., Fedora.</span>
</pre>
</div></li>

<li>Create a Triply API Token through the TriplyDB GUI.</li>

<li><p>
In your current terminal session, export the following environment
variables:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ export <span style="color: #BA36A5;">TRIPLY_API_TOKEN</span>=&lt;some-token&gt;
$ export <span style="color: #BA36A5;">TRIPLY_API_URL</span>=&lt;some-url&gt;
</pre>
</div>

<p>
You can also add these lines to your <code>.profile</code> file in order to
add these environment variables to every future terminal session.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orga92abb9" class="outline-3">
<h3 id="orga92abb9"><span class="section-number-3">1.2</span> Setting up a Triply Client project</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The following steps are needed in order to setup a TypeScript project
that uses the Triply Client library:
</p>

<ol class="org-ol">
<li><p>
Create a directory for your project:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ mkdir my_script
</pre>
</div></li>

<li><p>
Create a file called <code>package.json</code> with the following content
within the <code>my_script</code> directory:
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #0000FF;">"name"</span>: <span style="color: #008000;">"script"</span>,
  <span style="color: #0000FF;">"version"</span>: <span style="color: #008000;">"1.0.0"</span>
}
</pre>
</div></li>

<li><p>
Install the TypeScript and Triply Client dependencies from within
the <code>my_script</code> directory:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ npm install typescript @triply/client.js
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orga167662" class="outline-3">
<h3 id="orga167662"><span class="section-number-3">1.3</span> Create your first script</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Once you have performed the installation and project setup, perform
the following steps in order to create and run your first script that
uses the Triply Client library:
</p>

<ol class="org-ol">
<li><p>
Create a file called <code>script.ts</code> and add the following contents:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Import the Triply Client.</span>
<span style="color: #0000FF;">import</span> Client <span style="color: #0000FF;">from</span> <span style="color: #008000;">"@triply/client.js/build/src/App"</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Configure the Triply Client.</span>
<span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">client</span> = Client.<span style="color: #0000FF;">get</span>({
  token: process.env.TRIPLY_API_TOKEN,
  url: process.env.TRIPLY_API_URL
});

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Perform Triply Client requests within an async context.</span>
<span style="color: #0000FF;">async</span> <span style="color: #0000FF;">function</span> run() {
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Our first Triply Client request: obtain information of the</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">current user.</span>
  console.log(<span style="color: #0000FF;">await</span> client.getAccount().info());
}
run().<span style="color: #0000FF;">catch</span>(e =&gt; {
  console.error(e);
  process.exit(1);
});
</pre>
</div></li>
</ol>


<ol class="org-ol">
<li><p>
Compile the TypeScript file into a corresponding JavaScript file:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ ./node_modules/.bin/tsc script.ts
</pre>
</div></li>

<li><p>
Run the JavaScript file:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ node script.js
</pre>
</div></li>
</ol>

<p>
This should print the information of the current user to the terminal.
The current user is determined by the API Token that was set in the
<code>TRIPLY_API_TOKEN</code> environment variable.
</p>
</div>
</div>

<div id="outline-container-org18698b6" class="outline-3">
<h3 id="org18698b6"><span class="section-number-3">1.4</span> Using the Atom text editor (optional)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The Atom text editor provides advanced support for programming in
TypeScript, which makes it easier to use Triply Client by showing
typing feedback in the editor and offering autocomplete suggestions:
</p>

<ol class="org-ol">
<li>Install the <a href="https://atom.io">Atom</a> text editor.</li>

<li><p>
In order to let Atom use the correct TypeScript version, add a file
called <code>tsconfig.json</code> with the following contents to your project
directory:
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #0000FF;">"compilerOptions"</span>: {
    <span style="color: #0000FF;">"lib"</span>: [ <span style="color: #008000;">"es2015"</span> ]
  }
}
</pre>
</div></li>

<li>From within the Atom preferences page, install the <a href="https://atom.io/packages/atom-typescript">atom-typescript</a>
package.</li>

<li><p>
Start Atom over your script directory by running the following
command from your <code>my_project</code> directory:
</p>

<div class="org-src-container">
<pre class="src src-sh">atom .
</pre>
</div></li>
</ol>
</div>
</div>
</div>
