page/TriplyClient.org
* Reference

This section documents all methods that are currently available in
Triply Client.  Methods are grouped together for each object type to
which they apply.

** Code examples

Every function in this reference section comes with at least one code
example.  These code examples can be run by inserting them into the
following basic script structure:

#+begin_src typescript
import Client from "@triply/client.js/build/src/App";
const client = Client.get({
  url: process.env.TRIPLY_API_TOKEN,
  token: process.env.TRIPLY_API_URL
});
async function run() {
  // This is where operations that use the Triply API are performed.
  // All code examples that are given in this document must be placed
  // in this location in order to be executed.
}
run().catch(e => {
  console.error(e);
  process.exit(1);
});
#+end_src

The following subsections document the various Triply Client
functions.

** ~Client~
<<Client>>

*** ~getAccount()~
<<Client.getAccount/0>>

Returns the account associated with the current Triply API Token.

**** Example

The following example code returns the account associated with the
current Triply API Token:

#+begin_src typescript
console.log(await client.getAccount());
#+end_src

See section [[Account]] for an overview of the methods that can be used
with account objects.

*** ~getAccount(accountName: string)~
<<Client.getAccount/1>>

Returns the account with the given ~accountName~.

**** Example

The following example code returns a specific account called
~some-acount~:

#+begin_src typescript
console.log(await client.getAccount("some-account"));
#+end_src

See section [[Account]] for an overview of the methods that can be used
with account objects.

** ~Account~
<<Account>>

The ~Account~ class represents a TriplyDB account.  This can be either
a user or an organization.

Accounts cannot be created or deleted through the Triply Client
library.  See the [[https://wouterbeek.github.io/page/TriplyDB.html][TriplyDB documentation]] for how to create and delete
accounts (users and organizations) through the web-based GUI.

*** ~addDataset(settings: object)~
<<Account.addDataset/1>>

Argument ~settings~ is a JSON object with the following keys:

  - ~accessLevel~ :: The access level of the dataset.  The following
    values are supported:

    - ~"private"~ :: The dataset can only be accessed by the ~Account~
      object for which it is created.

    - ~"internal"~ :: The dataset can only be accessed by people who
      are logged into the TriplyDB instance (denoted by the value of
      environment variable ~TRIPLY_API_URL~).

    - ~"public"~ :: The dataset can be accessed by everybody.

  - ~name~ (optional) :: The name of the dataset.

  - ~description~ (optional) :: The description of the dataset.

  - ~license~ (optional) :: The license of the dataset.  The following
    license strings are currently supported:

    - ~"CC-BY-SA"~
    - ~"CC0 1.0"~
    - ~"GFDL"~
    - ~"ODC-By"~
    - ~"ODC-ODbL"~
    - ~"PDDL"~

**** Example

The following code example creates a new dataset (called
~"some-dataset"~) under a specific pre-existing account:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .addDataset({name: "some-dataset"}));
#+end_src

*** ~datasets()~
<<Account.datasets/0>>

Returns the list of datasets for this account that are accessible to
the user associated with the given Triply Token.

**** Example

The following example code prints the list of datasets that belong to
the specific account called ~some-account~:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .datasets());
#+end_src

*** ~getDataset(datasetName: string)~
<<Account.getDataset/1>>

Returns the dataset with the given ~datasetName~.

This function returns an object of type ~Dataset~.  See section
[[Dataset]] for an overview of the methods that can be used with dataset
objects.

**** Example

The following example code prints a specific dataset object:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .getDataset("some-dataset"));
#+end_src

*** ~info()~
<<Account.info/0>>

Returns information about the account.

**** Example

The following example code prints information about the account
associated with the current Triply API Token:

#+begin_src typescript
console.log(await client.getAccount().info());
#+end_src

Example output for running the above code:

#+begin_src json
{
  avatarUrl: "https://www.gravatar.com/avatar/9bc28997dd1074e405e1c66196d5e117?d=mm",
  accountName: "wouter",
  uid: "5aafcb9639b170025c5e4b99",
  name: "Wouter Beek",
  type: "user",
  createdAt: "Mon Mar 19 2018 14:39:18 GMT+0000 (Coordinated Universal Time)",
  siteAdmin: true,
  superAdmin: true,
  email: "wouter@triply.cc",
  updatedAt: "Tue Nov 27 2018 09:29:38 GMT+0000 (Coordinated Universal Time)",
  authMethod: "password",
  disabled: false,
  verified: true
}
#+end_src

*** ~name()~
<<Account.name/0>>

Returns the name of the account.

