page/TriplyClient.html

<div id="outline-container-org02c0449" class="outline-2">
<h2 id="org02c0449"><span class="section-number-2">2</span> Reference</h2>
<div class="outline-text-2" id="text-2">
<p>
This section documents all methods that are currently available in
Triply Client.  Methods are grouped together for each object type to
which they apply.
</p>
</div>

<div id="outline-container-orga914073" class="outline-3">
<h3 id="orga914073"><span class="section-number-3">2.1</span> Code examples</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Every function in this reference section comes with at least one code
example.  These code examples can be run by inserting them into the
following basic script structure:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">import</span> Client <span style="color: #0000FF;">from</span> <span style="color: #008000;">"@triply/client.js/build/src/App"</span>;
<span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">client</span> = Client.<span style="color: #0000FF;">get</span>({
  url: process.env.TRIPLY_API_TOKEN,
  token: process.env.TRIPLY_API_URL
});
<span style="color: #0000FF;">async</span> <span style="color: #0000FF;">function</span> run() {
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">This is where operations that use the Triply API are performed.</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">All code examples that are given in this document must be placed</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">in this location in order to be executed.</span>
}
run().<span style="color: #0000FF;">catch</span>(e =&gt; {
  console.error(e);
  process.exit(1);
});
</pre>
</div>

<p>
The following subsections document the various Triply Client
functions.
</p>
</div>
</div>

<div id="outline-container-org148f87f" class="outline-3">
<h3 id="org148f87f"><span class="section-number-3">2.2</span> <code>Client</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a id="org67132eb"></a>
</p>
</div>

<div id="outline-container-orgc1a9c20" class="outline-4">
<h4 id="orgc1a9c20"><span class="section-number-4">2.2.1</span> <code>getAccount()</code></h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<a id="org86d3536"></a>
</p>

<p>
Returns the account associated with the current Triply API Token.
</p>
</div>

<ol class="org-ol">
<li><a id="org8bb8140"></a>Example<br />
<div class="outline-text-5" id="text-2-2-1-1">
<p>
The following example code returns the account associated with the
current Triply API Token:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount());
</pre>
</div>

<p>
See section <a href="#org55539e3">2.3</a> for an overview of the methods that can be used
with account objects.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org30412d2" class="outline-4">
<h4 id="org30412d2"><span class="section-number-4">2.2.2</span> <code>getAccount(accountName: string)</code></h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<a id="org2ea3362"></a>
</p>

<p>
Returns the account with the given <code>accountName</code>.
</p>
</div>

<ol class="org-ol">
<li><a id="orgb812cc2"></a>Example<br />
<div class="outline-text-5" id="text-2-2-2-1">
<p>
The following example code returns a specific account called
<code>some-acount</code>:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>));
</pre>
</div>

<p>
See section <a href="#org55539e3">2.3</a> for an overview of the methods that can be used
with account objects.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgccb49fe" class="outline-3">
<h3 id="orgccb49fe"><span class="section-number-3">2.3</span> <code>Account</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a id="org55539e3"></a>
</p>

<p>
The <code>Account</code> class represents a TriplyDB account.  This can be either
a user or an organization.
</p>

<p>
Accounts cannot be created or deleted through the Triply Client
library.  See the <a href="https://wouterbeek.github.io/page/TriplyDB.html">TriplyDB documentation</a> for how to create and delete
accounts (users and organizations) through the web-based GUI.
</p>
</div>

<div id="outline-container-orgb2bfde2" class="outline-4">
<h4 id="orgb2bfde2"><span class="section-number-4">2.3.1</span> <code>addDataset(settings: object)</code></h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
<a id="org9008508"></a>
</p>

<p>
Argument <code>settings</code> is a JSON object with the following keys:
</p>

<dl class="org-dl">
<dt><code>accessLevel</code></dt><dd>The access level of the dataset.  The following
values are supported:

<dl class="org-dl">
<dt><code>"private"</code></dt><dd>The dataset can only be accessed by the <code>Account</code>
object for which it is created.</dd>

<dt><code>"internal"</code></dt><dd>The dataset can only be accessed by people who
are logged into the TriplyDB instance (denoted by the value of
environment variable <code>TRIPLY_API_URL</code>).</dd>

<dt><code>"public"</code></dt><dd>The dataset can be accessed by everybody.</dd>
</dl></dd>

<dt><code>name</code> (optional)</dt><dd>The name of the dataset.</dd>

<dt><code>description</code> (optional)</dt><dd>The description of the dataset.</dd>

<dt><code>license</code> (optional)</dt><dd>The license of the dataset.  The following
license strings are currently supported:

<ul class="org-ul">
<li><code>"CC-BY-SA"</code></li>
<li><code>"CC0 1.0"</code></li>
<li><code>"GFDL"</code></li>
<li><code>"ODC-By"</code></li>
<li><code>"ODC-ODbL"</code></li>
<li><code>"PDDL"</code></li>
</ul></dd>
</dl>
</div>

<ol class="org-ol">
<li><a id="orga33e657"></a>Example<br />
<div class="outline-text-5" id="text-2-3-1-1">
<p>
The following code example creates a new dataset (called
<code>"some-dataset"</code>) under a specific pre-existing account:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .addDataset({name: <span style="color: #008000;">"some-dataset"</span>}));
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org92b5f59" class="outline-4">
<h4 id="org92b5f59"><span class="section-number-4">2.3.2</span> <code>datasets()</code></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<a id="orgf50eac1"></a>
</p>

<p>
Returns the list of datasets for this account that are accessible to
the user associated with the given Triply Token.
</p>
</div>

<ol class="org-ol">
<li><a id="orgaeefde0"></a>Example<br />
<div class="outline-text-5" id="text-2-3-2-1">
<p>
The following example code prints the list of datasets that belong to
the specific account called <code>some-account</code>:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .datasets());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc6208c7" class="outline-4">
<h4 id="orgc6208c7"><span class="section-number-4">2.3.3</span> <code>getDataset(datasetName: string)</code></h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
<a id="org880f2ea"></a>
</p>

<p>
Returns the dataset with the given <code>datasetName</code>.
</p>

<p>
This function returns an object of type <code>Dataset</code>.  See section
<a href="#orgea72af2">2.4</a> for an overview of the methods that can be used with dataset
objects.
</p>
</div>

<ol class="org-ol">
<li><a id="orgdcde223"></a>Example<br />
<div class="outline-text-5" id="text-2-3-3-1">
<p>
The following example code prints a specific dataset object:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .getDataset(<span style="color: #008000;">"some-dataset"</span>));
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8c3b656" class="outline-4">
<h4 id="org8c3b656"><span class="section-number-4">2.3.4</span> <code>info()</code></h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
<a id="org993236d"></a>
</p>

<p>
Returns information about the account.
</p>
</div>

<ol class="org-ol">
<li><a id="orge14954b"></a>Example<br />
<div class="outline-text-5" id="text-2-3-4-1">
<p>
The following example code prints information about the account
associated with the current Triply API Token:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount().info());
</pre>
</div>

<p>
Example output for running the above code:
</p>

<div class="org-src-container">
<pre class="src src-json">{
  avatarUrl: <span style="color: #008000;">"https://www.gravatar.com/avatar/9bc28997dd1074e405e1c66196d5e117?d=mm"</span>,
  accountName: <span style="color: #008000;">"wouter"</span>,
  uid: <span style="color: #008000;">"5aafcb9639b170025c5e4b99"</span>,
  name: <span style="color: #008000;">"Wouter Beek"</span>,
  type: <span style="color: #008000;">"user"</span>,
  createdAt: <span style="color: #008000;">"Mon Mar 19 2018 14:39:18 GMT+0000 (Coordinated Universal Time)"</span>,
  siteAdmin: <span style="color: #D0372D;">true</span>,
  superAdmin: <span style="color: #D0372D;">true</span>,
  email: <span style="color: #008000;">"wouter@triply.cc"</span>,
  updatedAt: <span style="color: #008000;">"Tue Nov 27 2018 09:29:38 GMT+0000 (Coordinated Universal Time)"</span>,
  authMethod: <span style="color: #008000;">"password"</span>,
  disabled: <span style="color: #D0372D;">false</span>,
  verified: <span style="color: #D0372D;">true</span>
}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org672a850" class="outline-4">
<h4 id="org672a850"><span class="section-number-4">2.3.5</span> <code>name()</code></h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
<a id="org17ec663"></a>
</p>

<p>
Returns the name of the account.
</p>
</div>

<ol class="org-ol">
