page/TriplyClient.org
**** Example

The following example code prints the name of the account associated
with the current Triply API Token:

#+begin_src typescript
console.log(await client.getAccount().name());
#+end_src

*** ~rename(newName: string)~
<<Account.rename/1>>

Renames the account from its current name to the specified new name
(~newName~).

**** Example

The following example code renames a specific dataset from
~some-account~ to ~new-name~:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .rename("new-name"));
#+end_src

** ~Dataset~
<<Dataset>>

The ~Dataset~ class represents a TriplyDB dataset.

*** ~addService(serviceType: oneof("sparql"), name: string)~
<<Dataset.addService/2>>

Creates a new service for this dataset.

The ~serviceType~ argument specifies the type of service that is
created.  The following values are supported:

  - ~"sparql"~ :: Starts a SPARQL service.

The ~name~ argument can be used to distinguish between different
endpoints over the same dataset that are used for different tasks.

See section [[Service][Service]] for an overview of the methods that can be used
with service objects.

**** Example

The following example code starts two SPARQL endpoints over a specific
dataset.  One endpoint will be used in the acceptance environment
while the other endpoint will be used in the production system.

#+begin_src typescript
const dataset = await client.getAccount("some-account")
                            .getDataset("some-dataset");
const acceptance = dataset.addService("sparql", "acceptance");
const production = dataset.addService("sparql", "production");
#+end_src

*** ~assets()~
<<Dataset.assets/0>>

Returns an array with objects that represent the assets that belong to
this dataset.

**** Example

The following example code retrieves the assets for a specific
dataset:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .getDataset("some-dataset")
                        .assets());
#+end_src

*** ~delete()~
<<Dataset.delete/0>>

Deletes the dataset.  This includes deleting the dataset metadata, all
of its graphs, and all of its assets.

Use the following functions in order to delete graphs while retaining
dataset metadata and assets:

  - [[Dataset.deleteGraph/1][~deleteGraph(graphName: string)~]]
  - [[Dataset.removeAllGraphs/0][~removeAllGraphs()~]]

**** Example 1

The following example code deletes a specific dataset that is part of
the account associated with the current Triply API Token:

#+begin_src typescript
await client.getAccount()
            .getDataset("some-dataset")
            .delete();
#+end_src

**** Example 2

The following example code only deletes a specific dataset if it
exists (notice the use of ~try~ and ~catch~):

#+begin_src typescript
await client.getAccount()
            .getDataset("some-dataset")
            .delete();
#+end_src

*** ~deleteGraph(graphName: string)~
<<Dataset.deleteGraph/1>>

Deletes a specific graph that belongs to this dataset.

**** Example

The following example code deletes a specific graph from a specific
dataset:

#+begin_src typescript
await client.getAccount()
            .getDataset("some-dataset")
            .deleteGraph("https://example.org/some-graph");
#+end_src

*** ~getServices()~
<<Dataset.getServices/0>>

Returns an array of objects that represent TriplyDB services.

**** Example

The following example code emits the services that are enabled for a
specific dataset:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .getDataset("some-dataset")
                        .getServices());
#+end_src

*** ~graphs()~
<<Dataset.graphs/0>>

Returns an array with objects that represent the graphs that belong to
this dataset.

**** Example

The following example code retrieves the graphs for a specific
dataset:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .getDataset("some-dataset")
                        .graphs());
#+end_src

*** ~import(fromDataset: Dataset, graphs: mapping)~
<<Dataset.import/2>>

~mapping~ is a JSON object whose keys are existing graph names in the
~fromDataset~ and whose values are new graph names in the
current/target dataset.

**** Example

The following code example creates a new dataset “d2” and imports one
graph from the existing dataset “d1”.  Notice that the graph can be
renamed as part of the import.

#+begin_src typescript
const dataset1 = await client.getAccount()
                             .getDataset("some-dataset");
const dataset2 = await client.getAccount()
                             .addDataset({accessLevel: "private",
                                          name: "other-dataset"});
await dataset1.import(dataset2,
                      {"https://example.org/dataset2/graph": "https://example.org/dataset1/graph"});
#+end_src

*** ~importedGraphs()~
<<Dataset.importedGraphs/0>>

Returns an array with objects that represent the imported graphs that
belong to this dataset.

