page/TriplyClient.html
<li><a id="orgbd0889f"></a>Example<br />
<div class="outline-text-5" id="text-2-3-5-1">
<p>
The following example code prints the name of the account associated
with the current Triply API Token:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount().name());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org82b1aee" class="outline-4">
<h4 id="org82b1aee"><span class="section-number-4">2.3.6</span> <code>rename(newName: string)</code></h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
<a id="org18aca83"></a>
</p>

<p>
Renames the account from its current name to the specified new name
(<code>newName</code>).
</p>
</div>

<ol class="org-ol">
<li><a id="org5e038f4"></a>Example<br />
<div class="outline-text-5" id="text-2-3-6-1">
<p>
The following example code renames a specific dataset from
<code>some-account</code> to <code>new-name</code>:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .rename(<span style="color: #008000;">"new-name"</span>));
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgfc01344" class="outline-3">
<h3 id="orgfc01344"><span class="section-number-3">2.4</span> <code>Dataset</code></h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a id="orgea72af2"></a>
</p>

<p>
The <code>Dataset</code> class represents a TriplyDB dataset.
</p>
</div>

<div id="outline-container-org0957934" class="outline-4">
<h4 id="org0957934"><span class="section-number-4">2.4.1</span> <code>addService(serviceType: oneof("sparql"), name: string)</code></h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
<a id="org87ede5b"></a>
</p>

<p>
Creates a new service for this dataset.
</p>

<p>
The <code>serviceType</code> argument specifies the type of service that is
created.  The following values are supported:
</p>

<dl class="org-dl">
<dt><code>"sparql"</code></dt><dd>Starts a SPARQL service.</dd>
</dl>

<p>
The <code>name</code> argument can be used to distinguish between different
endpoints over the same dataset that are used for different tasks.
</p>

<p>
See section <a href="#org43160c6">Service</a> for an overview of the methods that can be used
with service objects.
</p>
</div>

<ol class="org-ol">
<li><a id="org8b6038e"></a>Example<br />
<div class="outline-text-5" id="text-2-4-1-1">
<p>
The following example code starts two SPARQL endpoints over a specific
dataset.  One endpoint will be used in the acceptance environment
while the other endpoint will be used in the production system.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">dataset</span> = <span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                            .getDataset(<span style="color: #008000;">"some-dataset"</span>);
<span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">acceptance</span> = dataset.addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"acceptance"</span>);
<span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">production</span> = dataset.addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"production"</span>);
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org376c76f" class="outline-4">
<h4 id="org376c76f"><span class="section-number-4">2.4.2</span> <code>assets()</code></h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
<a id="orgc2074cd"></a>
</p>

<p>
Returns an array with objects that represent the assets that belong to
this dataset.
</p>
</div>

<ol class="org-ol">
<li><a id="orgfa1cb99"></a>Example<br />
<div class="outline-text-5" id="text-2-4-2-1">
<p>
The following example code retrieves the assets for a specific
dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                        .assets());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgda9db48" class="outline-4">
<h4 id="orgda9db48"><span class="section-number-4">2.4.3</span> <code>delete()</code></h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
<a id="orgddd8e3c"></a>
</p>

<p>
Deletes the dataset.  This includes deleting the dataset metadata, all
of its graphs, and all of its assets.
</p>

<p>
Use the following functions in order to delete graphs while retaining
dataset metadata and assets:
</p>

<ul class="org-ul">
<li><a href="#orgf1d49d1"><code>deleteGraph(graphName: string)</code></a></li>
<li><a href="#orge588897"><code>removeAllGraphs()</code></a></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgda8ffd5"></a>Example 1<br />
<div class="outline-text-5" id="text-2-4-3-1">
<p>
The following example code deletes a specific dataset that is part of
the account associated with the current Triply API Token:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount()
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .<span style="color: #0000FF;">delete</span>();
</pre>
</div>
</div>
</li>

<li><a id="orgdbe4e63"></a>Example 2<br />
<div class="outline-text-5" id="text-2-4-3-2">
<p>
The following example code only deletes a specific dataset if it
exists (notice the use of <code>try</code> and <code>catch</code>):
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount()
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .<span style="color: #0000FF;">delete</span>();
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org55a149e" class="outline-4">
<h4 id="org55a149e"><span class="section-number-4">2.4.4</span> <code>deleteGraph(graphName: string)</code></h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
<a id="orgf1d49d1"></a>
</p>

<p>
Deletes a specific graph that belongs to this dataset.
</p>
</div>

<ol class="org-ol">
<li><a id="orgabe6732"></a>Example<br />
<div class="outline-text-5" id="text-2-4-4-1">
<p>
The following example code deletes a specific graph from a specific
dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount()
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .deleteGraph(<span style="color: #008000;">"https://example.org/some-graph"</span>);
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgcd2c353" class="outline-4">
<h4 id="orgcd2c353"><span class="section-number-4">2.4.5</span> <code>getServices()</code></h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
<a id="org6c14435"></a>
</p>

<p>
Returns an array of objects that represent TriplyDB services.
</p>
</div>

<ol class="org-ol">
<li><a id="orgd29d390"></a>Example<br />
<div class="outline-text-5" id="text-2-4-5-1">
<p>
The following example code emits the services that are enabled for a
specific dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                        .getServices());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga6afe71" class="outline-4">
<h4 id="orga6afe71"><span class="section-number-4">2.4.6</span> <code>graphs()</code></h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
<a id="orgc82a9b7"></a>
</p>

<p>
Returns an array with objects that represent the graphs that belong to
this dataset.
</p>
</div>

<ol class="org-ol">
<li><a id="org063efd9"></a>Example<br />
<div class="outline-text-5" id="text-2-4-6-1">
<p>
The following example code retrieves the graphs for a specific
dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                        .graphs());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf8ce3fd" class="outline-4">
<h4 id="orgf8ce3fd"><span class="section-number-4">2.4.7</span> <code>import(fromDataset: Dataset, graphs: mapping)</code></h4>
<div class="outline-text-4" id="text-2-4-7">
<p>
<a id="orgcfcf605"></a>
</p>

<p>
<code>mapping</code> is a JSON object whose keys are existing graph names in the
<code>fromDataset</code> and whose values are new graph names in the
current/target dataset.
</p>
</div>

<ol class="org-ol">
<li><a id="org7b2ecda"></a>Example<br />
<div class="outline-text-5" id="text-2-4-7-1">
<p>
The following code example creates a new dataset “d2” and imports one
graph from the existing dataset “d1”.  Notice that the graph can be
renamed as part of the import.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">dataset1</span> = <span style="color: #0000FF;">await</span> client.getAccount()
                             .getDataset(<span style="color: #008000;">"some-dataset"</span>);
<span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">dataset2</span> = <span style="color: #0000FF;">await</span> client.getAccount()
                             .addDataset({accessLevel: <span style="color: #008000;">"private"</span>,
                                          name: <span style="color: #008000;">"other-dataset"</span>});
<span style="color: #0000FF;">await</span> dataset1.<span style="color: #0000FF;">import</span>(dataset2,
                      {<span style="color: #008000;">"https://example.org/dataset2/graph"</span>: <span style="color: #008000;">"https://example.org/dataset1/graph"</span>});
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org61c0a70" class="outline-4">
<h4 id="org61c0a70"><span class="section-number-4">2.4.8</span> <code>importedGraphs()</code></h4>
<div class="outline-text-4" id="text-2-4-8">
<p>
<a id="org5bd309f"></a>
</p>

<p>
Returns an array with objects that represent the imported graphs that
belong to this dataset.
</p>
</div>

<ol class="org-ol">
