page/TriplyClient.org
**** Example

The following example code retrieves the imported graphs for a
specific dataset:

#+begin_src typescript
console.log(await client.getAccount("some-account")
                        .getDataset("some-dataset")
                        .importedGraphs());
#+end_src

*** ~query()~
<<Dataset.query/0>>

Retrieves the query object for this dataset.

See section [[Query][Query]] for an overview of the methods that can be used with
query objects.

**** Example

The following code example retrieves the query object of a specific
dataset:

#+begin_src typescript
const query = client.getAccount("some-account")
                    .getDataset("some-dataset")
                    .query();
#+end_src

*** ~removeAllGraphs()~
<<Dataset.removeAllGraphs/0>>

Removes all graphs from this dataset.

**** Example

The following code example removed all graphs from a specific dataset:

#+begin_src typescript
await client.getAccount("some-account")
            .getDataset("some-dataset")
            .removeAllGraphs();
#+end_src

*** ~rename(newName: string)~
<<Dataset.rename/1>>

Renames the dataset from its current name to the name specified with
~newName~.

**** Example

The following example code renames a specific dataset from
~some-dataset~ to ~new-name~:

#+begin_src typescript
await client.getAccount("some-account")
            .getDataset("some-dataset")
            .rename("new-name");
#+end_src

*** ~renameGraph(fromGraphName: string, toGraphName: string)~
<<Dataset.renameGraph/2>>

Renames a graph of this dataset.

~fromGraphName~ and ~toGraphName~ must be valid IRIs.

**** Example

The following example code renames a specific graph of a specific
dataset:

#+begin_src typescript
const dataset = client.getAccount()
                      .getDataset("some-dataset");
await dataset.renameGraph("https://example.org/old-graph",
                          "https://example.org/new-graph");
#+end_src

*** ~upload(filePaths: string[])~
<<Dataset.upload/1>>

Adds the given file paths to the current upload job.

The files must contain RDF data and must be encoded in one of the
following standardized RDF serialization formats: N-Quads, N-Triples,
TriG, Turtle.

Use function [[Dataset.uploadAsset/2][~uploadAsset~]] in order to upload files that do not
contain RDF data.

Once the required files have been added to the current upload job, the
upload job can be executed with method ~getJob().exec()~ (see the
following example).

**** Example

The following example code adds four RDF document to the current
upload job of a specific dataset, and then performs the upload
afterwards.

#+begin_src typescript
const dataset = client.getAccount()
                      .getDataset("some-dataset");
await dataset.upload("file.nq",   // Uploading an N-Quads file,
                     "file.nt",   // and an N-Triples file,
                     "file.trig", // and a TriG file,
                     "file.ttl"); // and a Turtle file.
await dataset.getJob().exec();
#+end_src

*** ~uploadAsset(assetName: string, filePath: string)~
<<Dataset.uploadAsset/2>>

Uploads a file that does not contain RDF data as an asset.

Assets can be source data files prior to running an ETL process,
documentation files describing the dataset, or media files
(audio/image/video) that are referenced by the RDF graph.

**** Example

The following example code uploads a PDF file documenting the
corresponding dataset:

#+begin_src typescript
await client.getAccount()
            .getDataset("some-dataset")
            .uploadAsset("source.csv.gz",      // Upload source data,
                         "documentation.pdf"); // and documentation.
#+end_src

** ~Query~
<<Query>>

The query object allows Triple Pattern (TP) queries to be formulated
and executed.  The TP query paradigm is define in the SPARQL 1.1
specification: it allows triples to be matched by setting a
combination of a subject, predicate, and/or object term.  TriplyDB
also allows the graph term to set.

The following example code retrieves (at most) 100 subclass triples
from a specific dataset:

#+begin_src typescript
await client.getAccount()
            .getDataset("some-dataset")
            .query()
            .predicate("http://www.w3.org/2000/01/rdf-schema#subClassOf")
            .limit(100);
#+end_src

** ~Service~
<<Service>>

Service objects describe specific functionalities that can be started,
stopped, and restarted over datasets in TriplyDB.

Service objects are obtained through the [[Dataset.addService/2][addService]] and [[Dataset.getServices/0][getServices]]
functions.

*** ~create()~
<<Service.create/0>>

Starts this service.

**** Example

The following code example starts a specific service:

#+begin_src typescript
await client.getAccount("some-account")
            .getDataset("some-dataset")
            .addService("sparql", "new-service")
            .create();
#+end_src

*** ~getStatus()~
<<Service.getStatus/0>>

Returns the status of this service.

The following service statuses are defined:

  - removing
  - running
  - starting
  - stopped
  - stopping

