page/TriplyClient.html
<li><a id="org0b4e3cd"></a>Example<br />
<div class="outline-text-5" id="text-2-4-8-1">
<p>
The following example code retrieves the imported graphs for a
specific dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript">console.log(<span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                        .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                        .importedGraphs());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga0a8aa3" class="outline-4">
<h4 id="orga0a8aa3"><span class="section-number-4">2.4.9</span> <code>query()</code></h4>
<div class="outline-text-4" id="text-2-4-9">
<p>
<a id="orgf708fb9"></a>
</p>

<p>
Retrieves the query object for this dataset.
</p>

<p>
See section <a href="#org868264f">Query</a> for an overview of the methods that can be used with
query objects.
</p>
</div>

<ol class="org-ol">
<li><a id="orgd58a66d"></a>Example<br />
<div class="outline-text-5" id="text-2-4-9-1">
<p>
The following code example retrieves the query object of a specific
dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">query</span> = client.getAccount(<span style="color: #008000;">"some-account"</span>)
                    .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                    .query();
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6c982c2" class="outline-4">
<h4 id="org6c982c2"><span class="section-number-4">2.4.10</span> <code>removeAllGraphs()</code></h4>
<div class="outline-text-4" id="text-2-4-10">
<p>
<a id="orge588897"></a>
</p>

<p>
Removes all graphs from this dataset.
</p>
</div>

<ol class="org-ol">
<li><a id="org992bf14"></a>Example<br />
<div class="outline-text-5" id="text-2-4-10-1">
<p>
The following code example removed all graphs from a specific dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .removeAllGraphs();
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org26bebd0" class="outline-4">
<h4 id="org26bebd0"><span class="section-number-4">2.4.11</span> <code>rename(newName: string)</code></h4>
<div class="outline-text-4" id="text-2-4-11">
<p>
<a id="orgc5f7845"></a>
</p>

<p>
Renames the dataset from its current name to the name specified with
<code>newName</code>.
</p>
</div>

<ol class="org-ol">
<li><a id="org56bbc4b"></a>Example<br />
<div class="outline-text-5" id="text-2-4-11-1">
<p>
The following example code renames a specific dataset from
<code>some-dataset</code> to <code>new-name</code>:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .rename(<span style="color: #008000;">"new-name"</span>);
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6738cea" class="outline-4">
<h4 id="org6738cea"><span class="section-number-4">2.4.12</span> <code>renameGraph(fromGraphName: string, toGraphName: string)</code></h4>
<div class="outline-text-4" id="text-2-4-12">
<p>
<a id="org5d56a08"></a>
</p>

<p>
Renames a graph of this dataset.
</p>

<p>
<code>fromGraphName</code> and <code>toGraphName</code> must be valid IRIs.
</p>
</div>

<ol class="org-ol">
<li><a id="org738cece"></a>Example<br />
<div class="outline-text-5" id="text-2-4-12-1">
<p>
The following example code renames a specific graph of a specific
dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">dataset</span> = client.getAccount()
                      .getDataset(<span style="color: #008000;">"some-dataset"</span>);
<span style="color: #0000FF;">await</span> dataset.renameGraph(<span style="color: #008000;">"https://example.org/old-graph"</span>,
                          <span style="color: #008000;">"https://example.org/new-graph"</span>);
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1eac5e7" class="outline-4">
<h4 id="org1eac5e7"><span class="section-number-4">2.4.13</span> <code>upload(filePaths: string[])</code></h4>
<div class="outline-text-4" id="text-2-4-13">
<p>
<a id="orga64fdfd"></a>
</p>

<p>
Adds the given file paths to the current upload job.
</p>

<p>
The files must contain RDF data and must be encoded in one of the
following standardized RDF serialization formats: N-Quads, N-Triples,
TriG, Turtle.
</p>

<p>
Use function <a href="#org82bf02c"><code>uploadAsset</code></a> in order to upload files that do not
contain RDF data.
</p>

<p>
Once the required files have been added to the current upload job, the
upload job can be executed with method <code>getJob().exec()</code> (see the
following example).
</p>
</div>

<ol class="org-ol">
<li><a id="org2305703"></a>Example<br />
<div class="outline-text-5" id="text-2-4-13-1">
<p>
The following example code adds four RDF document to the current
upload job of a specific dataset, and then performs the upload
afterwards.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">dataset</span> = client.getAccount()
                      .getDataset(<span style="color: #008000;">"some-dataset"</span>);
<span style="color: #0000FF;">await</span> dataset.upload(<span style="color: #008000;">"file.nq"</span>,   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Uploading an N-Quads file,</span>
                     <span style="color: #008000;">"file.nt"</span>,   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">and an N-Triples file,</span>
                     <span style="color: #008000;">"file.trig"</span>, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">and a TriG file,</span>
                     <span style="color: #008000;">"file.ttl"</span>); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">and a Turtle file.</span>
<span style="color: #0000FF;">await</span> dataset.getJob().exec();
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org767ef1d" class="outline-4">
<h4 id="org767ef1d"><span class="section-number-4">2.4.14</span> <code>uploadAsset(assetName: string, filePath: string)</code></h4>
<div class="outline-text-4" id="text-2-4-14">
<p>
<a id="org82bf02c"></a>
</p>

<p>
Uploads a file that does not contain RDF data as an asset.
</p>

<p>
Assets can be source data files prior to running an ETL process,
documentation files describing the dataset, or media files
(audio/image/video) that are referenced by the RDF graph.
</p>
</div>

<ol class="org-ol">
<li><a id="org13e32c5"></a>Example<br />
<div class="outline-text-5" id="text-2-4-14-1">
<p>
The following example code uploads a PDF file documenting the
corresponding dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount()
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .uploadAsset(<span style="color: #008000;">"source.csv.gz"</span>,      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Upload source data,</span>
                         <span style="color: #008000;">"documentation.pdf"</span>); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">and documentation.</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgd1a7a46" class="outline-3">
<h3 id="orgd1a7a46"><span class="section-number-3">2.5</span> <code>Query</code></h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a id="org868264f"></a>
</p>

<p>
The query object allows Triple Pattern (TP) queries to be formulated
and executed.  The TP query paradigm is define in the SPARQL 1.1
specification: it allows triples to be matched by setting a
combination of a subject, predicate, and/or object term.  TriplyDB
also allows the graph term to set.
</p>

<p>
The following example code retrieves (at most) 100 subclass triples
from a specific dataset:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount()
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .query()
            .predicate(<span style="color: #008000;">"http://www.w3.org/2000/01/rdf-schema#subClassOf"</span>)
            .limit(100);
</pre>
</div>
</div>
</div>

<div id="outline-container-org29cde6f" class="outline-3">
<h3 id="org29cde6f"><span class="section-number-3">2.6</span> <code>Service</code></h3>
<div class="outline-text-3" id="text-2-6">
<p>
<a id="org43160c6"></a>
</p>

<p>
Service objects describe specific functionalities that can be started,
stopped, and restarted over datasets in TriplyDB.
</p>

<p>
Service objects are obtained through the <a href="#org87ede5b">addService</a> and <a href="#org6c14435">getServices</a>
functions.
</p>
</div>

<div id="outline-container-orga6b6d58" class="outline-4">
<h4 id="orga6b6d58"><span class="section-number-4">2.6.1</span> <code>create()</code></h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
<a id="orgc34615f"></a>
</p>

<p>
Starts this service.
</p>
</div>

<ol class="org-ol">
<li><a id="orgdccaee2"></a>Example<br />
<div class="outline-text-5" id="text-2-6-1-1">
<p>
The following code example starts a specific service:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"new-service"</span>)
            .create();
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org24552cb" class="outline-4">
<h4 id="org24552cb"><span class="section-number-4">2.6.2</span> <code>getStatus()</code></h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
<a id="orgc7f0b0f"></a>
</p>

<p>
Returns the status of this service.
</p>

<p>
The following service statuses are defined:
</p>

<ul class="org-ul">
<li>removing</li>
<li>running</li>
<li>starting</li>
<li>stopped</li>
<li>stopping</li>
</ul>
</div>

<ol class="org-ol">
