page/TriplyClient.org
**** Example

The following example code prints the status of a specific service:

#+begin_src typescript
const service = await client.getAccount("some-account")
                            .getDataset("some-dataset")
                            .addService("sparql", "new-service");
console.log(service.getStatus());
#+end_src

*** ~info()~
<<Service.info/0>>

Returns information about this service.

**** Example

The following example code prints information about a newly created
service:

#+begin_src typescript
const service = await client.getAccount("some-account")
                            .getDataset("some-dataset")
                            .addService("sparql", "new-service");
console.log(service.info());
#+end_src

*** ~isUpToDate()~
<<Service.isUpToDate/0>>

Returns whether this service is synchronized with the dataset
contents.

Because services must be explicitly synchonized in TriplyDB, it is
possible to have services that expose an older version of the dataset
and services that expose a newer version of the dataset running next
to one another.  There are two very common use cases for this:

  - The production version of an application or website runs on an
    older service.  The data does not change, so the application keeps
    working.  The acceptance version of the same application or
    website runs on a newer service.  Once the acceptance version is
    finished, it becomes the production version and a new services for
    the new acceptance version is created, etc.

  - An old service is used by legacy software.  New users are using
    the newer endpoint over the current version of the data, but a
    limited number of older users wants to use the legacy version.

**** Example

The following example code checks whether a specific service is
synchonized:

#+begin_src typescript
const service = await client.getAccount("some-account")
                            .getDataset("some-dataset")
                            .addService("sparql", "new-service");
console.log(service.isUpToDate());
#+end_src

*** ~restart()~
<<Service.restart/0>>

Restarts this service.

**** Example

The following code example restarts a specific service:

#+begin_src typescript
await client.getAccount("some-account")
            .getDataset("some-dataset")
            .addService("sparql", "new-service")
            .restart();
#+end_src

* FAQ

This section includes answers to frequently asked questions.  Please
contact [[mailto:info@triply.cc][info@triply.cc]] if you have a question that does not appear in
this list.

** How to perform a SPARQL query?

The SPARQL 1.1 Protocol standard specifies a native HTTP API for
perfoming SPARQL requests.  Such requests can be performed with
regular HTTP libraries.  Here we give an example using such an HTTP
library:

#+begin_src typescript
import * as SuperAgent from "superagent";
const reply = await SuperAgent.post("URL-OF-SOME-SPARQL-ENDPOINT")
                              .set("Accept", "application/sparql-results+json")
                              .set("Authorization",
                                   "Bearer "+process.env.TRIPLY_API_TOKEN)
                              .buffer(true)
                              .send({"query": "select * { ?s ?p ?o } limit 1"});

#+end_src

** What to do when the following error appears?
*** Why must I set environment variable ~TRIPLY_API_TOKEN~?

It is common for scripts to be shared with others and/or get published
online using services like Github and Gitlab.  Since the API token is
private, it must never be used in the TypeScript script file directly.

*** Error: Unauthorized

This error appears whenever an operation is performed for which the
user denoted by the current Triply API Token is not authorized.

One common appearance of this error is when the environment variable
~TRIPLY_API_TOKEN~ is not set to a Triply API Token.

The current value of the environment variable can be tested by running
the following command:

#+begin_src sh
echo $TRIPLY_API_TOKEN
#+end_src

*** "No domain specified in configuration"

This error indicates that the ~TRIPLY_API_URL~ environment variable
has not been set.  This variable must be set to a Triply API URL.

The current value of the environment variable can be tested by running
the following command:

#+begin_src sh
echo $TRIPLY_API_URL
#+end_src

