page/TriplyClient.html
<li><a id="org76f314b"></a>Example<br />
<div class="outline-text-5" id="text-2-6-2-1">
<p>
The following example code prints the status of a specific service:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">service</span> = <span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                            .addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"new-service"</span>);
console.log(service.getStatus());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org4c54a67" class="outline-4">
<h4 id="org4c54a67"><span class="section-number-4">2.6.3</span> <code>info()</code></h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
<a id="orgc9d93ef"></a>
</p>

<p>
Returns information about this service.
</p>
</div>

<ol class="org-ol">
<li><a id="org4af1cad"></a>Example<br />
<div class="outline-text-5" id="text-2-6-3-1">
<p>
The following example code prints information about a newly created
service:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">service</span> = <span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                            .addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"new-service"</span>);
console.log(service.info());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1fff52b" class="outline-4">
<h4 id="org1fff52b"><span class="section-number-4">2.6.4</span> <code>isUpToDate()</code></h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
<a id="org95103bf"></a>
</p>

<p>
Returns whether this service is synchronized with the dataset
contents.
</p>

<p>
Because services must be explicitly synchonized in TriplyDB, it is
possible to have services that expose an older version of the dataset
and services that expose a newer version of the dataset running next
to one another.  There are two very common use cases for this:
</p>

<ul class="org-ul">
<li>The production version of an application or website runs on an
older service.  The data does not change, so the application keeps
working.  The acceptance version of the same application or
website runs on a newer service.  Once the acceptance version is
finished, it becomes the production version and a new services for
the new acceptance version is created, etc.</li>

<li>An old service is used by legacy software.  New users are using
the newer endpoint over the current version of the data, but a
limited number of older users wants to use the legacy version.</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org1b4ed9c"></a>Example<br />
<div class="outline-text-5" id="text-2-6-4-1">
<p>
The following example code checks whether a specific service is
synchonized:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">service</span> = <span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
                            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
                            .addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"new-service"</span>);
console.log(service.isUpToDate());
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1100990" class="outline-4">
<h4 id="org1100990"><span class="section-number-4">2.6.5</span> <code>restart()</code></h4>
<div class="outline-text-4" id="text-2-6-5">
<p>
<a id="org766e7a1"></a>
</p>

<p>
Restarts this service.
</p>
</div>

<ol class="org-ol">
<li><a id="orgd98b9b3"></a>Example<br />
<div class="outline-text-5" id="text-2-6-5-1">
<p>
The following code example restarts a specific service:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">await</span> client.getAccount(<span style="color: #008000;">"some-account"</span>)
            .getDataset(<span style="color: #008000;">"some-dataset"</span>)
            .addService(<span style="color: #008000;">"sparql"</span>, <span style="color: #008000;">"new-service"</span>)
            .restart();
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org918ac2a" class="outline-2">
<h2 id="org918ac2a"><span class="section-number-2">3</span> FAQ</h2>
<div class="outline-text-2" id="text-3">
<p>
This section includes answers to frequently asked questions.  Please
contact <a href="mailto:info@triply.cc">info@triply.cc</a> if you have a question that does not appear in
this list.
</p>
</div>

<div id="outline-container-org7ade194" class="outline-3">
<h3 id="org7ade194"><span class="section-number-3">3.1</span> How to perform a SPARQL query?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The SPARQL 1.1 Protocol standard specifies a native HTTP API for
perfoming SPARQL requests.  Such requests can be performed with
regular HTTP libraries.  Here we give an example using such an HTTP
library:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #0000FF;">import</span> * <span style="color: #0000FF;">as</span> SuperAgent <span style="color: #0000FF;">from</span> <span style="color: #008000;">"superagent"</span>;
<span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">reply</span> = <span style="color: #0000FF;">await</span> SuperAgent.post(<span style="color: #008000;">"URL-OF-SOME-SPARQL-ENDPOINT"</span>)
                              .<span style="color: #0000FF;">set</span>(<span style="color: #008000;">"Accept"</span>, <span style="color: #008000;">"application/sparql-results+json"</span>)
                              .<span style="color: #0000FF;">set</span>(<span style="color: #008000;">"Authorization"</span>,
                                   <span style="color: #008000;">"Bearer "</span>+process.env.TRIPLY_API_TOKEN)
                              .buffer(<span style="color: #0000FF;">true</span>)
                              .send({<span style="color: #008000;">"query"</span>: <span style="color: #008000;">"select * { ?s ?p ?o } limit 1"</span>});

</pre>
</div>
</div>
</div>

<div id="outline-container-org54116b5" class="outline-3">
<h3 id="org54116b5"><span class="section-number-3">3.2</span> What to do when the following error appears?</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org384bae0" class="outline-4">
<h4 id="org384bae0"><span class="section-number-4">3.2.1</span> Why must I set environment variable <code>TRIPLY_API_TOKEN</code>?</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
It is common for scripts to be shared with others and/or get published
online using services like Github and Gitlab.  Since the API token is
private, it must never be used in the TypeScript script file directly.
</p>
</div>
</div>

<div id="outline-container-orgfecd499" class="outline-4">
<h4 id="orgfecd499"><span class="section-number-4">3.2.2</span> Error: Unauthorized</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
This error appears whenever an operation is performed for which the
user denoted by the current Triply API Token is not authorized.
</p>

<p>
One common appearance of this error is when the environment variable
<code>TRIPLY_API_TOKEN</code> is not set to a Triply API Token.
</p>

<p>
The current value of the environment variable can be tested by running
the following command:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">TRIPLY_API_TOKEN</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org77b05fa" class="outline-4">
<h4 id="org77b05fa"><span class="section-number-4">3.2.3</span> "No domain specified in configuration"</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
This error indicates that the <code>TRIPLY_API_URL</code> environment variable
has not been set.  This variable must be set to a Triply API URL.
</p>

<p>
The current value of the environment variable can be tested by running
the following command:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">TRIPLY_API_URL</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wouter Beek</p>
<p class="date">Created: 2019-05-08 Wed 08:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
